# Getting and knowing data

In [83]:
import pandas as pd
import numpy as np

## STEP 1 : Import Dataset

In [84]:
df = pd.read_csv('chipotle.tsv', sep= "\t")

In [85]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Dataset Overview

In [10]:
df.shape #=> 4622 rows and 5 columns

(4622, 5)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [16]:
list(df.columns) # return columns names

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [18]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [21]:
df.describe() # only return the numerical values
df.describe(include='all') #add the include='all' to include all values that is not numerical values

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

# Loc and ILoc (Location and Index Location)

In [36]:
df.loc[(df.quantity == 2) & (df.item_name == 'Chicken Bowl'),['order_id','quantity','item_name']]

      order_id  quantity     item_name
4            2         2  Chicken Bowl
154         70         2  Chicken Bowl
282        124         2  Chicken Bowl
415        181         2  Chicken Bowl
654        271         2  Chicken Bowl
976        401         2  Chicken Bowl
1017       418         2  Chicken Bowl
1106       457         2  Chicken Bowl
1429       578         2  Chicken Bowl
1588       643         2  Chicken Bowl
1832       741         2  Chicken Bowl
2075       837         2  Chicken Bowl
2106       848         2  Chicken Bowl
2339       932         2  Chicken Bowl
2510       997         2  Chicken Bowl
2525      1004         2  Chicken Bowl
2580      1023         2  Chicken Bowl
2771      1100         2  Chicken Bowl
2942      1170         2  Chicken Bowl
3080      1227         2  Chicken Bowl
3133      1249         2  Chicken Bowl
3151      1257         2  Chicken Bowl
3423      1374         2  Chicken Bowl
3508      1410         2  Chicken Bowl
3612      1447         2  Chicken Bowl
3618      1449         2  Chicken Bowl
3663      1465         2  Chicken Bowl
3843      1540         2  Chicken Bowl
3976      1593         2  Chicken Bowl
4423      1764         2  Chicken Bowl
4435      1767         2  Chicken Bowl

In [43]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [52]:
df.iloc[[9]]

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [54]:
df.iloc[3:10]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [86]:
X = df.iloc[3:5,:-1] # -1 to specify the column 0 to n-1 (not include n-1)
Y =  df.iloc[3:5,-1]

# Data Manipulation

In [87]:
df.item_price.dtype

dtype('O')

In [88]:
df.item_price = df.item_price.apply(lambda x : float(x.replace('$','')))

In [89]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [92]:
df["Total cost"] =  df.quantity * df.item_price
df.head()

,order_id,quantity,item_name,choice_description,item_price,Total cost
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [95]:
df['Total cost'].sum()

np.float64(39237.02)

In [104]:
df.groupby('item_name')['quantity'].sum().sort_values(ascending = False).head(5) #get 5 most-ordered items ,should group by sort and sum values

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

## Find the  unique items

In [108]:
df.item_name.value_counts().count()

np.int64(50)

In [109]:
df.item_name.nunique()

50